{
    "title": "Retrosynthetic accessibility score (RAscore) – rapid machine learned synthesizability classification from AI driven retrosynthetic planning",
    "authors": "A. Thakkar, V. Chadimová, E. J. Bjerrum, O. Engkvist, J.-L. Reymond",
    "journal": "Chemical Science",
    "year": 2021,
    "suggested_slug": "retrosynthetic-accessibility-score",
    "suggested_computational_title": "RAscore, rapid synthetic feasibility classification with AiZynthFinder",
    "tldr": "RAscore is a machine learning-based tool for rapid synthetic feasibility classification, enhancing virtual screening by assessing synthetic accessibility using AiZynthFinder.",
    "summary": "The publication introduces RAscore, a machine learning-based classifier designed to quickly estimate the synthetic feasibility of compounds by utilizing the predictions from the computer-aided synthesis planning tool AiZynthFinder. RAscore significantly accelerates the process of determining synthetic accessibility by offering predictions that are 4500 times faster compared to traditional retrosynthetic analysis. The method is capable of pre-screening large databases of virtual molecules for their synthetic accessibility, thereby refining compound libraries before further evaluation of biological activity. RAscore is a versatile tool that can be retrained on data from any computer-aided synthesis planning tool, allowing it to adapt to advancements in synthesis planning technologies. The model and its training protocols have been made publicly accessible, offering a customizable approach to synthetic accessibility assessment.",
    "relevance_to_biomedical_research": "RAscore enhances the drug discovery process by allowing rapid pre-screening of virtual compounds for synthetic accessibility, improving efficiency and quality of compound libraries.",
    "computational_methods": "RAscore employs machine learning classifiers, including feed forward neural networks, XGBoost, and random forests, to estimate retrosynthetic accessibility. The classifiers are trained on data generated by AiZynthFinder from ChEMBL, GDBChEMBL, and GDBMedChem databases, labeling compounds as solvable or unsolvable based on retrosynthetic analysis. The input is a molecular fingerprint, specifically ECFP6, and the output is a binary classification indicating synthetic feasibility. The models achieve high accuracy and area under the curve (AUC), surpassing existing complexity-based synthetic accessibility scores. The training dataset consists of 200,000 compounds from ChEMBL and 100,000 each from GDBChEMBL and GDBMedChem, with the neural network model demonstrating significant improvements in prediction speed.",
    "biomedical_keywords": [
        "Synthetic accessibility",
        "Virtual screening",
        "Drug discovery"
    ],
    "computational_keywords": [
        "Retrosynthetic planning",
        "Machine learning classifiers",
        "AiZynthFinder"
    ],
    "strengths": "RAscore offers a rapid and reliable method for assessing synthetic feasibility, adapting to current technologies, with public model availability enhancing its adoption.",
    "limitations": "RAscore's accuracy depends on AiZynthFinder's performance, relying on learned similarity rather than explicit routes, which may limit precision in some cases.",
    "overall_relevance": "RAscore is significant in computational chemistry, enhancing virtual screening efficiency in drug discovery, making it a valuable tool in streamlining drug development."
}