{
    "title": "Retrospective assessment of rat liver microsomal stability at NCATS: data and QSAR models",
    "authors": "V. B. Siramshetty, P. Shah, E. Kerns, K. Nguyen, K. R. Yu, M. Kabir, J. Williams, J. Neyra, N. Southall, D. T. Nguyễn, X. Xu",
    "journal": "Scientific Reports",
    "year": 2020,
    "suggested_slug": "rat-liver-microsomal-stability-qsar",
    "suggested_computational_title": "QSAR models for rat liver microsomal stability prediction",
    "tldr": "A study developed QSAR models using machine learning to predict rat liver microsomal stability using a dataset of ~24,000 compounds from NCATS.",
    "summary": "The study focused on building quantitative structure-activity relationship (QSAR) models to predict rat liver microsomal (RLM) stability, a crucial pharmacokinetic parameter in drug discovery. Using data generated by the National Center for Advancing Translational Sciences (NCATS) from 2012 to 2020 for ~24,000 compounds, computational models were constructed employing various machine learning techniques. These models aim to predict RLM stability and aid in the design of metabolically stable compounds. The study also involved a time-split validation approach and development of local models for specific projects that underperformed with global models. The models, developed using open-source software, are made publicly available, marking the first instance of publicly accessible RLM prediction models built with high-quality data from a single laboratory.",
    "relevance_to_biomedical_research": "Predicting hepatic metabolic stability is critical in drug discovery to avoid compounds with poor pharmacokinetic profiles. These models help identify compounds with favorable metabolic stability early, streamlining lead optimization and potentially reducing drug attrition rates.",
    "computational_methods": "The study employed several machine learning techniques to develop QSAR models for predicting RLM stability, including Random Forest, Deep Neural Networks, Graph Convolutional Neural Networks, and Recurrent Neural Networks with LSTM architecture. Input data comprised molecular descriptors and fingerprints, and models were validated using cross-validation and time-split strategies. GCNN models showed consistent performance, achieving balanced accuracy and Cohen's Kappa up to 0.64.",
    "biomedical_keywords": [
        "Metabolic stability",
        "Drug discovery",
        "Pharmacokinetics"
    ],
    "computational_keywords": [
        "QSAR models",
        "Graph convolutional neural networks",
        "Time-split validation"
    ],
    "strengths": "The publication provides a comprehensive dataset and QSAR models for predicting rat liver microsomal stability, enhancing early-stage drug discovery. The use of diverse machine learning techniques and validation strategies demonstrates thorough evaluation of model performance.",
    "limitations": "The study's models are based on rodent data, which may not fully extrapolate to human metabolism. The dataset cannot be entirely disclosed due to proprietary concerns, potentially limiting external validation. The performance of models varies by project.",
    "overall_relevance": "The publication holds medium to high relevance in drug discovery, particularly for its contribution to predictive models for metabolic stability. The novelty of publicly available RLM data and models enhances its impact, despite limitations in applicability to human pharmacokinetics."
}