{
    "title": "Self-Referencing Embedded Strings (SELFIES): A 100% robust molecular string representation",
    "authors": "M. Krenn, F. Häse, A. K. Nigam, P. Friederich, A. Aspuru-Guzik",
    "journal": "Not specified",
    "year": 2020,
    "suggested_slug": "selfies-robust-molecular-representation",
    "suggested_computational_title": "SELFIES, robust molecular representation for ML models",
    "tldr": "SELFIES is a robust molecular string representation ensuring 100% valid molecules, enhancing the performance of machine learning models in cheminformatics.",
    "summary": "SELFIES (SELF-referencing Embedded Strings) is introduced as a robust molecular string representation that guarantees each string corresponds to a valid molecule. This development addresses the limitations of the traditional SMILES representation, which often generates invalid strings. SELFIES can be integrated into machine learning models without the need for adaptation, ensuring all generated molecular candidates are valid. Experiments demonstrate that SELFIES can encode a significantly more diverse set of molecules compared to SMILES, enhancing the performance of generative models like Variational Autoencoders (VAEs) and Generative Adversarial Networks (GANs). SELFIES' robustness ensures that even random mutations of strings result in valid molecules, making it an ideal tool for inverse molecular design and interpretation of neural network models in chemistry.",
    "relevance_to_biomedical_research": "The development of SELFIES is highly relevant to drug discovery, as it provides a robust method for encoding molecular structures, ensuring that all candidate molecules generated by computational models are valid. This advancement in molecular representation can significantly aid in the exploration of chemical space, facilitating the discovery of novel drug candidates.",
    "computational_methods": "SELFIES leverages string-based molecular representation to ensure 100% validity, overcoming limitations of SMILES. It uses derivation rules incorporating syntactic and semantic validity, ensuring valence-bond constraints are met. Compared to SMILES, SELFIES enables the generation of a more diverse set of molecules while maintaining validity, crucial for machine learning applications. The method was tested with generative models like VAEs and GANs, using QM9 dataset, showing SELFIES encoded orders of magnitude more diverse molecules than SMILES, with 100% validity.",
    "biomedical_keywords": [
        "Molecular representation",
        "Drug discovery",
        "Chemical space"
    ],
    "computational_keywords": [
        "SELFIES",
        "Variational Autoencoder (VAE)",
        "Generative Adversarial Network (GAN)"
    ],
    "strengths": "SELFIES provides a groundbreaking solution to invalid molecular representations in cheminformatics. Its 100% validity ensures every generated molecular string is valid, enhancing reliability and interpretability of machine learning models. The approach improves diversity of encoded molecules, crucial for successful de-novo molecular design.",
    "limitations": "While SELFIES offers a robust and valid molecular representation, its adoption as a standard may require further work to cover more complex molecules, including ions and stereochemistry. Extending the grammar to larger chemical structures could be challenging.",
    "overall_relevance": "The introduction of SELFIES is a significant advancement in molecular informatics, providing a robust solution to SMILES' limitations. Its relevance is high for drug discovery and cheminformatics, though limited by its focus on small biomolecules and need for further standardization."
}